app/Http/Controllers/Site/ArticleController.php

	public function show($id)
	{
		$post = Post::with(['image', 'comments' => function ($query) {
			return $query->whereNull('comment_id');
		}, 'comments.reply.user', 'comments.user'])
			->where('slug', $id)->first();
        $count = VisitorTracker::where('ip', \Request()->ip())
        ->where('url', \Request::url())->count();
---
select count(*) as aggregate from `visitor_trackers` where `ip` = '::1' and `url` = 'http://localhost/temancms/public/article/cinta'