app/Http/Controllers/Site/ArticleController.php


	                        if($ads_info->ad_type == 'image'){

	                            $detail = galleryImage::find($ads_info->ad_image_id);
---
select * from `images` where `images`.`id` = '8' limit 1