app/Http/Controllers/Site/ArticleController.php

select * from `comments` where `comments`.`post_id` in (9) and `comment_id` is null
select * from `images` where `images`.`id` in (6)
select * from `posts` where `slug` = 'cinta' limit 1
select * from `visitor_trackers`
select * from `users` where `users`.`id` in (1)
select * from `images` where `images`.`id` in (8)
select * from `posts` where `slug` = 'putri-bimbim-mezzaluna-ungkap-lagu-slank-favoritnya' limit 1
---
	public function show($id)
	{
		$post = Post::with(['image', 'comments' => function ($query) {
			return $query->whereNull('comment_id');
		}, 'comments.reply.user', 'comments.user'])
			->where('slug', $id)->first();
        $count = VisitorTracker::all()->last();
        $url   = \Request::url();
        $ip    = \Request()->ip();
        // return $url;
		if ($count->url !== $url && $count->ip !== $ip ) {

			$post->total_hit = $post->total_hit+1;
			$post->timestamps = false;

			$post->save();

			if ($post->auth_required == 1 && Sentinel::check() == false) {
				return view('site2.pages.403');
			}
		} else {
		$post               = Post::with(['image','quizQuestions','quizQuestions.quizAnswers','quizResults','comments'=> function ($query) {
										return $query->whereNull('comment_id');
									}, 'comments.reply.user', 'comments.user'])
									->where('slug', $id)->first();

select * from `images` where `images`.`id` = '8' limit 1
---

	                        if($ads_info->ad_type == 'image'){

	                            $detail = galleryImage::find($ads_info->ad_image_id);

select * from `posts` where `posts`.`category_id` in (1) and `id` != 7 order by `id` desc limit 8
select * from `reactions` where `post_id` = 7 and `ip_address` = '127.0.0.1' limit 1
---
	        }
	    endif;

		$categoryWithPost = Category::with(['post' => function ($query) use ($post) {
			return $query->limit(8)->orderBy('id', 'desc')->where('id', '!=', $post->id);
		}])->find($post->category_id);
		$relatedPost = data_get($categoryWithPost, 'post');

		$data['is_you'] = Reaction::where('post_id', $post->id)->where('ip_address', \Request::ip())->first();

select * from `social_media` where `status` = 1
---
		$tracker->date = date('Y-m-d');
		$tracker->agent_browser = UserAgentBrowser(\Request()->header('User-Agent'));
		$tracker->save();
        $socialMedias       = SocialMedia::where('status', 1)->get();

select * from `social_media` where `status` = 1
select * from `posts` where LOWER(title) like '%%' limit 6
select count(*) as aggregate from `posts` where LOWER(title) like '%%'
---
    public function search(Request $request)
    {
        $widgetService = new WidgetService();
        $widgets = $widgetService->getWidgetDetails();
        $socialMedias       = SocialMedia::where('status', 1)->get();
        try{
            $posts = Post::where(DB::raw('LOWER(title)'), 'like', '%' . strtolower($request->get('search')) . '%')
                ->when(Sentinel::check() == false, function ($query) {
                    $query->where('auth_required', 0);
                })
                ->limit(6)->get();

            $totalPostCount = Post::where(DB::raw('LOWER(title)'), 'like', '%' . strtolower($request->get('search')) . '%')
                ->when(Sentinel::check() == false, function ($query) {
                    $query->where('auth_required', 0);
                })->count();

select * from `categories` where `slug` = 'reportase' limit 1
select * from `images` where `images`.`id` in (4, 6, 7, 8, 9, 10)
select * from `posts` where `category_id` = 1 and `visibility` = 1 and `status` = 1 and `language` = 'en' order by `id` desc limit 6
select * from `users` where `users`.`id` in (1)
select * from `posts` where `category_id` = 2 and `visibility` = 1 and `status` = 1 and `auth_required` = 0 and `language` = 'en' order by `id` desc limit 6
select count(*) as aggregate from `posts` where `category_id` = 1 and `visibility` = 1 and `status` = 1 and `language` = 'en'
---
	public function postByCategory($slug)
	{
		try {
			$id = Category::where('slug', $slug)->first()->id;
			$posts = Post::with(['image', 'user'])->where('category_id', $id)->where('visibility', 1)
				->where('status', 1)
				->when(Sentinel::check() == false, function ($query) {
					$query->where('auth_required', 0);
				})
				->orderBy('id', 'desc')
				->where('language', LaravelLocalization::setLocale() ?? settingHelper('default_language'))->limit(6)
				->get();

			$totalPostCount = Post::where('category_id', $id)->where('visibility', 1)
				->where('status', 1)
				->when(Sentinel::check() == false, function ($query) {
					$query->where('auth_required', 0);
				})
				->orderBy('id', 'desc')
				->where('language', LaravelLocalization::setLocale() ?? settingHelper('default_language'))
				->count();

select * from `social_media` where `status` = 1
---
			$tracker->ip = \Request()->ip();
			$tracker->agent_browser = UserAgentBrowser(\Request()->header('User-Agent'));
			$tracker->save();
            $socialMedias       = SocialMedia::where('status', 1)->get();