app/Http/Controllers/Site/HomeController.php

    public function home()
    {
        $primarySection             = Cache::rememberForever('primarySection', function (){
                                        return ThemeSection::where('is_primary', 1)->first();
                                    });

        $language = LaravelLocalization::setLocale() ?? settingHelper('default_language');

        if (Sentinel::check()):

            if (!View::exists('site2.website.'.$language.'.logged.widgets')):
                $this->widgetsSection($language);
            endif;

            if($primarySection->status == 1):

                $primarySectionPosts    = Cache::remember('primarySectionPostsAuth', $seconds = 200, function () {
                    return Post::with(['category', 'image', 'user'])
                        ->where('visibility', 1)
                        ->where('status', 1)
                        ->where('slider', '!=', 1)
                        ->where('language', LaravelLocalization::setLocale() ?? settingHelper('default_language'))
                        ->orderBY('id', 'desc')
                        ->limit(10)->get();
---
select * from `theme_sections` where `is_primary` = 1 limit 1
select * from `categories` where `categories`.`id` in (1)
select * from `images` where `images`.`id` in (2, 3, 4, 6, 7)
select * from `posts` where `visibility` = 1 and `status` = 1 and `slider` != 1 and `language` = 'en' order by `id` desc limit 10
select * from `users` where `users`.`id` in (1)


            endif;

            $sliderPosts            = Cache::remember('sliderPostsAuth', $seconds = 200, function () {
                return  Post::with(['category', 'image', 'user'])
                    ->where('visibility', 1)
                    ->where('slider', 1)
                    ->where('status', 1)
                    ->where('language', LaravelLocalization::setLocale() ?? settingHelper('default_language'))
                    ->orderBY('id', 'desc')
                    ->limit(5)->get();
            });

            $categorySections       = Cache::remember('categorySectionsAuth', $seconds = 200, function () {
                return ThemeSection::with('ad')
                    ->with(['category'])
                    ->where('is_primary', '<>', 1)->orderBy('order', 'ASC')
                    ->where(function ($query) {
                        $query->where('language', LaravelLocalization::setLocale() ?? settingHelper('default_language'))->orWhere('language', null);
                    })
                    ->get();
---
select * from `categories` where 0 = 1
select * from `categories` where `categories`.`id` in (1)
select * from `images` where `images`.`id` in (3)
select * from `posts` where `visibility` = 1 and `slider` = 1 and `status` = 1 and `language` = 'en' order by `id` desc limit 5
select * from `users` where `users`.`id` in (1)
select * from `theme_sections` where `is_primary` <> 1 and (`language` = 'en' or `language` is null) order by `order` asc

            });

            $video_posts     = Cache::remember('video_postsAuth', $seconds = 200, function () {
                return Post::with('category', 'image', 'user')
                    ->where('post_type', 'video')
                    ->where('visibility', 1)
                    ->where('status', 1)
                    ->orderBy('id', 'desc')
                    ->where('language', LaravelLocalization::setLocale() ?? settingHelper('default_language'))
                    ->limit(8)
                    ->get();
            });

            $latest_posts       = Cache::remember('latest_postsAuth', $seconds = 200, function () {
                return Post::with('category', 'image', 'user')
                    ->where('visibility', 1)
                    ->where('status', 1)
                    ->orderBy('id', 'desc')
                    ->where('language', LaravelLocalization::setLocale() ?? settingHelper('default_language'))
                    ->limit(6)
                    ->get();
            });

            $totalPostCount     = Cache::remember('totalPostCountAuth', $seconds = 200, function () {
                return Post::where('visibility', 1)
                    ->where('status', 1)
                    ->orderBy('id', 'desc')
                    ->where('language', LaravelLocalization::setLocale() ?? settingHelper('default_language'))
                    ->count();
---
select * from `categories` where `categories`.`id` in (1)
select * from `images` where `images`.`id` in (3)
select * from `posts` where `post_type` = 'video' and `visibility` = 1 and `status` = 1 and `language` = 'en' order by `id` desc limit 8
select * from `users` where `users`.`id` in (1)
select * from `images` where `images`.`id` in (2, 3, 4, 6, 7)
select * from `posts` where `visibility` = 1 and `status` = 1 and `language` = 'en' order by `id` desc limit 6
select count(*) as aggregate from `posts` where `visibility` = 1 and `status` = 1 and `language` = 'en'

            if($primarySection->status == 1):

                $primarySectionPosts    = Cache::remember('primarySectionPosts', $seconds = 200, function () {
                    return Post::with(['category', 'image', 'user'])
                        ->where('visibility', 1)
                        ->where('status', 1)
                        ->where('slider', '!=', 1)
                        ->where('language', LaravelLocalization::setLocale() ?? settingHelper('default_language'))
                        ->orderBY('id', 'desc')
                        ->when(Sentinel::check() == false, function ($query) {
                            $query->where('auth_required', 0);
                        })
                        ->limit(10)->get();
---
select * from `categories` where `categories`.`id` in (1, 2)
select * from `images` where `images`.`id` in (2, 3, 4, 6, 7)
select * from `posts` where `visibility` = 1 and `status` = 1 and `slider` != 1 and `language` = 'en' and `auth_required` = 0 order by `id` desc limit 10
select * from `users` where `users`.`id` in (1)


            endif;

            $sliderPosts            = Cache::remember('sliderPosts', $seconds = 200, function () {
                return  Post::with(['category', 'image', 'user'])
                    ->where('visibility', 1)
                    ->where('slider', 1)
                    ->where('status', 1)
                    ->where('language', LaravelLocalization::setLocale() ?? settingHelper('default_language'))
                    ->when(Sentinel::check() == false, function ($query) {
                        $query->where('auth_required', 0);
                    })
                    ->orderBY('id', 'desc')
                    ->limit(5)->get();
            });

            $categorySections       = Cache::remember('categorySections', $seconds = 200, function () {
                return ThemeSection::with('ad')
                    ->with(['category'])
                    ->where('is_primary', '<>', 1)->orderBy('order', 'ASC')
                    ->where(function ($query) {
                        $query->where('language', LaravelLocalization::setLocale() ?? settingHelper('default_language'))->orWhere('language', null);
                    })
                    ->get();
---
select * from `categories` where 0 = 1
select * from `categories` where `categories`.`id` in (2)
select * from `images` where `images`.`id` in (10)
select * from `posts` where `visibility` = 1 and `slider` = 1 and `status` = 1 and `language` = 'en' and `auth_required` = 0 order by `id` desc limit 5
select * from `users` where `users`.`id` in (1)
select * from `theme_sections` where `is_primary` <> 1 and (`language` = 'en' or `language` is null) order by `order` asc

            });

            $video_posts     = Cache::remember('video_posts', $seconds = 200, function () {
                return Post::with('category', 'image', 'user')
                    ->where('post_type', 'video')
                    ->where('visibility', 1)
                    ->where('status', 1)
                    ->when(Sentinel::check() == false, function ($query) {
                        $query->where('auth_required', 0);
                    })
                    ->orderBy('id', 'desc')
                    ->where('language', LaravelLocalization::setLocale() ?? settingHelper('default_language'))
                    ->limit(8)
                    ->get();
            });

            $latest_posts       = Cache::remember('latest_posts', $seconds = 200, function () {
                return Post::with('category', 'image', 'user')
                    ->where('visibility', 1)
                    ->where('status', 1)
                    ->when(Sentinel::check() == false, function ($query) {
                        $query->where('auth_required', 0);
                    })
                    ->orderBy('id', 'desc')
                    ->where('language', LaravelLocalization::setLocale() ?? settingHelper('default_language'))
                    ->limit(6)
                    ->get();
            });

            $totalPostCount     = Cache::remember('totalPostCount', $seconds = 200, function () {
                return Post::where('visibility', 1)
                    ->where('status', 1)
                    ->when(Sentinel::check() == false, function ($query) {
                        $query->where('auth_required', 0);
                    })
                    ->orderBy('id', 'desc')
                    ->where('language', LaravelLocalization::setLocale() ?? settingHelper('default_language'))
                    ->count();
---
select * from `categories` where `categories`.`id` in (2)
select * from `images` where `images`.`id` in (3)
select * from `posts` where `post_type` = 'video' and `visibility` = 1 and `status` = 1 and `auth_required` = 0 and `language` = 'en' order by `id` desc limit 8
select * from `users` where `users`.`id` in (1)
select * from `categories` where `categories`.`id` in (1, 2)
select * from `images` where `images`.`id` in (4, 6, 7, 8, 9, 10)
select * from `posts` where `visibility` = 1 and `status` = 1 and `auth_required` = 0 and `language` = 'en' order by `id` desc limit 6
select count(*) as aggregate from `posts` where `visibility` = 1 and `status` = 1 and `auth_required` = 0 and `language` = 'en'