app/Http/Controllers/Site/PageController.php

    public function page( $id )
    {
        try{
            $page               = Page::where('slug', $id)->first();
            $socialMedias       = SocialMedia::where('status', 1)->get();

            $tracker = new VisitorTracker();
            $tracker->page_type = \App\Enums\VisitorPageType::PageDetailPage;
            $tracker->slug = $id;
            $tracker->url = \Request::url();
            $tracker->source_url = \url()->previous();
            $tracker->ip = \Request()->ip();
            $tracker->date = date('Y-m-d');
            $tracker->agent_browser = UserAgentBrowser(\Request()->header('User-Agent'));
            $tracker->save();
---
select * from `pages` where `slug` = 'contact-us' limit 1
select * from `social_media` where `status` = 1
insert into `visitor_trackers` (`page_type`, `slug`, `url`, `source_url`, `ip`, `date`, `agent_browser`, `updated_at`, `created_at`) values (3, 'contact-us', 'http://127.0.0.1:8000/page/contact-us', 'http://127.0.0.1:8000/', '127.0.0.1', '2022-09-06', 'Google Chrome', '2022-09-06 09:17:35', '2022-09-06 09:17:35')