app/Http/Controllers/Site/UserController.php

select * from `users` where `email` = 'cyberfazri@gmail.com' limit 1
---
    public function login(Request $request)
    {
        if( settingHelper('captcha_visibility') == 1):
        $request->validate([
            'email'         => ['required', 'string', 'email', 'max:255'],
            'password'      => ['required', 'string'],
            'g-recaptcha-response'      => ['required', 'string'],
        ]);
        else:

            $request->validate([
                'email'         => ['required', 'string', 'email', 'max:255'],
                'password'      => ['required', 'string'],
            ]);

        endif;

        $user = User::where('email', $request->email)->first();