Modules/Post/Http/Controllers/PostController.php

select * from `categories`
select * from `languages` where `status` = 'active' order by `name` asc
select count(*) as aggregate from `images`
select * from `categories` where `categories`.`id` in (1, 2)
select * from `images` where `images`.`id` in (2, 3, 4, 6, 7, 8, 9, 10)
select * from `posts` order by `id` desc limit 15 offset 0
---
    public function index()
    {
        $categories     = Category::all();
        $activeLang     = Language::where('status', 'active')->orderBy('name', 'ASC')->get();
        $posts          = Post::orderBy('id','desc')->with('image','video','category','subCategory','user')->paginate('15');

select * from `categories` where `language` = 'en'
select * from `sub_categories`
select * from `languages` where `status` = 'active' order by `name` asc
select count(*) as aggregate from `videos`
---
    public function createArticle()
    {
        $categories     = Category::where('language', LaravelLocalization::setLocale() ?? settingHelper('default_language'))->get();
        $subCategories  = SubCategory::all();
        $activeLang     = Language::where('status', 'active')->orderBy('name', 'ASC')->get();
        $countImage     = galleryImage::count();
        $countVideo     = Video::count();

select * from `categories` where `categories`.`id` in (2)
select * from `images` where `images`.`id` in (3)
select * from `posts` where `posts`.`slider` = 1 order by `id` desc limit 15 offset 0
select * from `users` where `users`.`id` in (1)
---
    public function slider()
    {
         $posts     = Post::orderBy('id','desc')->where('posts.slider',1)->with('image','category','subCategory','user')->paginate('15');

select * from `posts` where `posts`.`id` = '5' limit 1
---
    public function updateSliderOrder(Request $request){
        if (strtolower(\Config::get('app.demo_mode')) == 'yes'):
            return redirect()->back()->with('error', __('You are not allowed to add/modify in demo mode.'));
        endif;

        for($i=0;$i<count($request->post_id);$i++):
            $post               =   Post::find($request->post_id[$i]);

select * from `categories` where `language` = 'en'
select * from `sub_categories`
select * from `languages` where `status` = 'active' order by `name` asc
select count(*) as aggregate from `videos`
---
    public function createVideoPost(){
        $categories         = Category::where('language', LaravelLocalization::setLocale() ?? settingHelper('default_language'))->get();
        $subCategories      = SubCategory::all();
        $activeLang         = Language::where('status', 'active')->orderBy('name', 'ASC')->get();
        $countImage         = galleryImage::count();
        $countVideo         = Video::count();