Modules/Post/Http/Controllers/RssController.php

    public function index()
    {
        $categories     = Category::all();
        $activeLang     = Language::where('status', 'active')->orderBy('name', 'ASC')->get();
        $feeds          = RssFeed::orderBy('id','desc')->with('category','subCategory')->paginate('15');
---
select * from `categories`
select * from `languages` where `status` = 'active' order by `name` asc
select count(*) as aggregate from `rss_feeds`